app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY '--- !ruby/hash:ActiveSupport::HashWithIndifferentAccess
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R') ORDER BY release_date
---
  def index

    if params[:sort].nil? && params[:ratings].nil? &&
        (!session[:sort].nil? || !session[:ratings].nil?)
      redirect_to movies_path(:sort => session[:sort], :ratings => session[:ratings])
    end

    @sort = params[:sort]
    @ratings = params[:ratings]

    @all_ratings = Movie.arr
    @checked_ratings = (params[:ratings].present? ? params[:ratings] : [])
    @movies = Movie.scoped

    if @sort && Movie.attribute_names.include?(@sort)
      @movies = @movies.order @sort
    end
    if @checked_ratings.empty?
      @checked_ratings = @all_ratings
    else
      if @checked_ratings == Array
        @movies = @movies.where :rating => @checked_ratings